Documents/АттестацияСотрудников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Document>
		<Properties>
			<Name>АттестацияСотрудников</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Комиссия</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ФизическоеЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Статус</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ЧленыАттестационнойКомиссии</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Аттестуемые</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Подразделение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФизическоеЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Должность</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Должности</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДолжностьПослеАттестации</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Должности</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Решение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РешенияАттестационнойКомиссии</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РезультатТестирования</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РезультатПрактическогоЗадания</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РезультатГолосования</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаПереаттестации</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбязательнаяПереаттестация</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/АттестацияСотрудников/Forms/ФормаДокумента/Ext/Form/Module.bsl
//&НаКлиенте
//Процедура АттестуемыеДолжностьПослеАттестацииНачалоВыбораИзСписка(Элемент, СтандартнаяОбработка)
//	с=4;
//КонецПроцедуры

&НаКлиенте
Процедура АттестуемыеДолжностьПослеАттестацииНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ТекущиеДанные = Элементы.Аттестуемые.ТекущиеДанные;
	
	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить( "Подразделение",  ТекущиеДанные.Подразделение);
	ПараметрыФормы.Вставить( "Дата", 		   Объект.ДатаНачала);
	ОткрытьФорму("Справочник.Должности.Форма.ФормаВыбораДляАттестации", ПараметрыФормы, Элемент);
	СтандартнаяОбработка = Ложь;
	
	
КонецПроцедуры

&НаКлиенте
Процедура АттестуемыеФизическоеЛицоПриИзменении(Элемент)
	ТекущиеДанные = Элементы.Аттестуемые.ТекущиеДанные;
	
	
	ПодразделениеДолжность = АттестуемыеФизическоеЛицоПриИзмененииНаСервере(Объект.ДатаНачала, ТекущиеДанные.ФизическоеЛицо );
	ЗаполнитьЗначенияСвойств( ТекущиеДанные, ПодразделениеДолжность );
КонецПроцедуры

&НаСервереБезКонтекста
Функция АттестуемыеФизическоеЛицоПриИзмененииНаСервере(Дата, ФизическоеЛицо )
	ПД = Новый Структура("Подразделение,Должность");
	Сотрудники = УП_КадрыСервер.СотрудникиФизЛица( ФизическоеЛицо, Дата );
	Для Каждого Сотрудник ИЗ Сотрудники  Цикл
		Если Сотрудник.Должность.Производственная  Тогда
			ЗаполнитьЗначенияСвойств( ПД, Сотрудник );
			Возврат ПД;
		КонецЕсли;
	КонецЦикла;
	
	Возврат ПД;
	
	// Вставить содержимое обработчика.
КонецФункции
